STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE_Thread/Ble_Thread_Dyn_SED/STM32_WPAN/App/app_thread.c
  /* Init config buffer and call TL_THREAD_Init */
  APP_THREAD_TL_THREAD_INIT();

  /* Configure UART for sending CLI command from M4 */
  APP_THREAD_Init_UART_CLI();

  /* Send Thread start system cmd to M0 */
  ThreadInitStatus = SHCI_C2_THREAD_Init();
  
  /* Prevent unused argument(s) compilation warning */
  UNUSED(ThreadInitStatus);

  /* Register task */
  /* Create the different tasks */
  UTIL_SEQ_RegTask( 1<<(uint32_t)CFG_TASK_MSG_FROM_M0_TO_M4, UTIL_SEQ_RFU, APP_THREAD_ProcessMsgM0ToM4);
  UTIL_SEQ_RegTask( 1<<(uint32_t)CFG_TASK_COAP_MSG_BUTTON, UTIL_SEQ_RFU, APP_THREAD_SendCoapMsg);

  UTIL_SEQ_RegTask( 1<<(uint32_t)CFG_TASK_COAP_SEND_MSG, UTIL_SEQ_RFU,APP_THREAD_SendCoapMsg);
  UTIL_SEQ_RegTask( 1<<(uint32_t)CFG_TASK_SET_THREAD_MODE, UTIL_SEQ_RFU,APP_THREAD_SetSleepyEndDeviceMode);
}

void APP_THREAD_Init_Dyn_2(void) {
  /* Initialize and configure the Thread device*/
  APP_THREAD_DeviceConfig();

  /**
   * Create timer to handle COAP request sending
   */
  HW_TS_Create(CFG_TIM_PROC_ID_ISR, &sedCoapTimerID, hw_ts_Repeated, APP_THREAD_CoapTimingElapsed);
  /* Allow the 800_15_4 IP to enter in low power mode */
  SHCI_C2_RADIO_AllowLowPower(THREAD_IP,/*TRUE*/ FALSE);

  /**
   * Create timer to change Thread Mode to SED
   */
  HW_TS_Create(CFG_TIM_PROC_ID_ISR, &setThreadModeTimerID, hw_ts_SingleShot, APP_THREAD_SetThreadMode);

/* Allow stop mode after Thread initialization*/
  UTIL_LPM_SetStopMode(1 << CFG_LPM_APP_THREAD, UTIL_LPM_ENABLE);

}

void APP_THREAD_Stop(void)
{
  otError error;
  /* STOP THREAD */
  error = otThreadSetEnabled(NULL, false);
  if (error != OT_ERROR_NONE)
  {
     APP_THREAD_Error(ERR_THREAD_STOP,error);
  }
}

void APP_THREAD_CleanCallbacks(void)
{
  otRemoveStateChangeCallback(NULL, APP_THREAD_StateNotif, NULL);
  otCoapRemoveResource(NULL, &OT_Ressource);

  /* Remove Timers if any */
  HW_TS_Delete(setThreadModeTimerID);
  HW_TS_Delete(sedCoapTimerID);
}

/**
  * @brief  Trace the error or the warning reported.
  * @param  ErrId :
  * @param  ErrCode
  * @retval None
  */
void APP_THREAD_Error(uint32_t ErrId, uint32_t ErrCode)
{

  switch(ErrId)
   {
       case ERR_REC_MULTI_MSG_FROM_M0 :
             APP_THREAD_TraceError("ERROR : ERR_REC_MULTI_MSG_FROM_M0 ",ErrCode);
             break;
       case ERR_THREAD_SET_STATE_CB :
             APP_THREAD_TraceError("ERROR : ERR_THREAD_SET_STATE_CB ",ErrCode);
             break;
       case ERR_THREAD_SET_CHANNEL :
             APP_THREAD_TraceError("ERROR : ERR_THREAD_SET_CHANNEL ",ErrCode);
             break;
       case ERR_THREAD_SET_PANID :
             APP_THREAD_TraceError("ERROR : ERR_THREAD_SET_PANID ",ErrCode);
             break;
       case ERR_THREAD_IPV6_ENABLE :
             APP_THREAD_TraceError("ERROR : ERR_THREAD_IPV6_ENABLE ",ErrCode);
             break;
       case ERR_THREAD_COAP_START :
             APP_THREAD_TraceError("ERROR : ERR_THREAD_COAP_START ",ErrCode);
             break;
       case ERR_THREAD_COAP_ADD_RESSOURCE :
             APP_THREAD_TraceError("ERROR : ERR_THREAD_COAP_ADD_RESSOURCE ",ErrCode);
             break;
       case ERR_THREAD_MESSAGE_READ :
             APP_THREAD_TraceError("ERROR : ERR_THREAD_MESSAGE_READ ",ErrCode);
             break;
       case ERR_THREAD_COAP_SEND_RESPONSE :
             APP_THREAD_TraceError("ERROR : ERR_THREAD_COAP_SEND_RESPONSE ",ErrCode);
             break;
       case ERR_THREAD_COAP_APPEND :
             APP_THREAD_TraceError("ERROR : ERR_THREAD_COAP_APPEND ",ErrCode);
             break;
       case ERR_THREAD_COAP_SEND_REQUEST :
             APP_THREAD_TraceError("ERROR : ERR_THREAD_COAP_SEND_REQUEST ",ErrCode);
             break;
       case ERR_TIMER_INIT :
             APP_THREAD_TraceError("ERROR : ERR_TIMER_INIT ",ErrCode);
             break;
       case ERR_TIMER_START :
             APP_THREAD_TraceError("ERROR : ERR_TIMER_START ",ErrCode);
             break;
       case ERR_THREAD_CHECK_WIRELESS :
             APP_THREAD_TraceError("ERROR : ERR_THREAD_CHECK_WIRELESS ",ErrCode);
             break;
        default :
            APP_THREAD_TraceError("ERROR Unknown ",0);
            break;
   }
}

/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/


/**
 * @brief Thread initialization.
 *        This function configure the Thread mesh network.
 * @param  None
 * @retval None
 */
static void APP_THREAD_DeviceConfig(void)
{
  otError error;
#ifndef DYNAMIC_MODE
  /* Configure the standard values */
  error = otInstanceErasePersistentInfo(NULL);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_ERASE_PERSISTENT_INFO,error);
  }
#endif
  otInstanceFinalize(NULL);
  otInstanceInitSingle();
  error = otSetStateChangedCallback(NULL, APP_THREAD_StateNotif, NULL);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_SET_STATE_CB,error);
  }
#if OT_AUTOSTART_MODE
  error = otLinkSetChannel(NULL, C_CHANNEL_NB);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_SET_CHANNEL,error);
  }
  error = otLinkSetPanId(NULL, C_PANID);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_SET_PANID,error);
  }
  error = otIp6SetEnabled(NULL, true);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_IPV6_ENABLE,error);
  }
#ifdef DYNAMIC_MODE
  error = otThreadSetEnabled(NULL, true);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_START,error);
  }
#if 1
  /* Start the COAP server */
  error = otCoapStart(NULL, OT_DEFAULT_COAP_PORT);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_COAP_START,error);
  }
  /* Add COAP resources */
  error = otCoapAddResource(NULL, &OT_Ressource);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_COAP_ADD_RESSOURCE,error);
  }
#endif
#endif
#endif
}

/**
 * @brief Thread notification when the state changes.
 *        When the Thread device change state, a specific LED
 *        color is being displayed.
 *        LED2 On (Green) means that the device is in "Leader" mode.
 *        LED3 On (Red) means that the device is in "Child: mode or
 *             in "Router" mode.
 *        LED2 and LED3 off means that the device is in "Disabled"
 *             or "Detached" mode.
 *
 * @param  aFlags  : Define the item that has been modified
 *         aContext: Context
 * @retval None
 */
static void APP_THREAD_StateNotif(uint32_t NotifFlags, void *pContext)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(pContext);
  if ((NotifFlags & (uint32_t)OT_CHANGED_THREAD_ROLE) == (uint32_t)OT_CHANGED_THREAD_ROLE)
    {
    switch (otThreadGetDeviceRole(NULL))
        {
        case OT_DEVICE_ROLE_DISABLED:
            BSP_LED_Off(LED2);
            BSP_LED_Off(LED3);
            APP_DBG_MSG("\r\n M4: SET CFG_Evt_ThreadStop in Thread_Change_Notification \r\n\n");
            APP_DBG("THREAD: Disabled");
            UTIL_SEQ_SetEvt(1<<CFG_Evt_ThreadStop);
            break;
        case OT_DEVICE_ROLE_DETACHED:
            BSP_LED_Off(LED2);
            BSP_LED_Off(LED3);
            APP_DBG("THREAD: Detached");
            break;
        case OT_DEVICE_ROLE_CHILD:
            BSP_LED_Off(LED2);
            BSP_LED_On(LED3);
            APP_DBG("THREAD: Child");
            HW_TS_Start(setThreadModeTimerID, (uint32_t)THREAD_CHANGE_MODE_TIMEOUT);
            break;
        case OT_DEVICE_ROLE_ROUTER :
            BSP_LED_Off(LED2);
            BSP_LED_On(LED3);
            APP_DBG("THREAD: Router");
            // HW_TS_Start(setThreadModeTimerID, (uint32_t)THREAD_CHANGE_MODE_TIMEOUT);
            break;
        case OT_DEVICE_ROLE_LEADER :
            BSP_LED_On(LED2);
            BSP_LED_Off(LED3);
#if OT_AUTOSTART_MODE && OT_COAP_START
            HW_TS_Start(sedCoapTimerID, (uint32_t)COAP_SEND_TIMEOUT);
#endif
            APP_DBG("THREAD: Leader");
            break;
        default:
            BSP_LED_Off(LED2);
            BSP_LED_Off(LED3);
            break;
        }
    }
}

/**
 * @brief Task associated to the push button.
 * @param  None
 * @retval None
 */
static void APP_THREAD_SendCoapMsg(void)
{
  APP_DBG("APP_THREAD_SendCoapMsg");
  APP_THREAD_SendCoapMulticastRequest(1);
}
/**
  * @brief Handler called when the server receives a COAP request.
  * @param pContext : Context
  * @param pHeader : Header
  * @param pMessage : Message
  * @param pMessageInfo : Message information
  * @retval None
  */
static void APP_THREAD_CoapRequestHandler(void                * pContext,
                                          otCoapHeader        * pHeader,
                                          otMessage           * pMessage,
                                          const otMessageInfo * pMessageInfo)
{
  do
  {
    if (otCoapHeaderGetType(pHeader) != OT_COAP_TYPE_NON_CONFIRMABLE)
    {
      break;
    }

    if (otCoapHeaderGetCode(pHeader) != OT_COAP_CODE_PUT)
    {
      break;
    }

