STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE_Thread/Ble_Thread_Dyn_SED/STM32_WPAN/App/app_thread.c
    if (otMessageRead(pMessage, otMessageGetOffset(pMessage), &OT_ReceivedCommand, 1U) != 1U)
    {
      APP_THREAD_Error(ERR_THREAD_MESSAGE_READ, 0);
    }

    if (OT_ReceivedCommand == 1U)
    {
      BSP_LED_Toggle(LED3);
      APP_DBG("**** Recept COAP nb **** %d ",DebugRxCoapCpt++);
    }

  } while (false);
}

/**
  * @brief Send a COAP multicast request to all the devices which are connected
  *        on the Thread network
  * @param command : Command associated to the COAP request.
  * @retval None
  */
static void APP_THREAD_SendCoapMulticastRequest(uint8_t command)
{
  otError error = OT_ERROR_NONE;

  OT_Command = command;

  /* Forbid the 800_15_4 IP to enter in low power mode.
   *
   * Reason for that...
   * As soon as the M0 is receiving an ot cmd, it wake up the IP 802_15_4,
   * send the command and put back the IP 802_15_4 in sleep mode when possible.
   * If the application send too much ot_cmd commands sequentially, the IP 802_15_4
   * will wake up and sleep at a non reasonable speed. It is why it is advised
   * to control when the IP 802_15_4 radio is allowed to enter in low power.
   */
  SHCI_C2_RADIO_AllowLowPower(THREAD_IP,FALSE);

  /* Send the COAP request */
  do
  {
    otCoapHeaderInit(&OT_Header, OT_COAP_TYPE_NON_CONFIRMABLE, OT_COAP_CODE_PUT);
    otCoapHeaderAppendUriPathOptions(&OT_Header,C_RESSOURCE);
    otCoapHeaderSetPayloadMarker(&OT_Header);

    pOT_Message = otCoapNewMessage(NULL, &OT_Header);
    if (pOT_Message == NULL)
    {
      break;
    }

    error = otMessageAppend(pOT_Message, &OT_Command, sizeof(command));
    if (error != OT_ERROR_NONE)
    {
      APP_THREAD_Error(ERR_THREAD_COAP_APPEND,error);
      break;
    }

    memset(&OT_MessageInfo, 0, sizeof(OT_MessageInfo));
    OT_MessageInfo.mInterfaceId = OT_NETIF_INTERFACE_ID_THREAD;
    OT_MessageInfo.mPeerPort = OT_DEFAULT_COAP_PORT;
    otIp6AddressFromString("FF03::1", &OT_MessageInfo.mPeerAddr);

    error = otCoapSendRequest(NULL,
                              pOT_Message,
                              &OT_MessageInfo,
                              NULL,
                              NULL);
  } while (false);

  APP_DBG("*** Send COAP nb **** %d",DebugTxCoapCpt++);

  if (error != OT_ERROR_NONE && pOT_Message != NULL)
  {
    otMessageFree(pOT_Message);
    APP_THREAD_Error(ERR_THREAD_COAP_SEND_REQUEST,error);
  }

  /* Allow the 800_15_4 IP to enter in low power mode */
  SHCI_C2_RADIO_AllowLowPower(THREAD_IP,TRUE);
}


/**
 * @brief This function is used to set the sleepyEndDevice mode
 *        and configure its pool period.
 *
 * @param None
 * @retval None
 */
static void APP_THREAD_SetSleepyEndDeviceMode(void)
{
  otError   error = OT_ERROR_NONE;

  APP_DBG("Set pool period to %d seconds", THREAD_LINK_POLL_PERIOD);

  /* Set the pool period to 5 sec. It means that when the device will enter
   * in 'sleepy end device' mode, it will send an ACK_Request every 5 sec.
   * This message will act as keep alive message.
   */
  otLinkSetPollPeriod(NULL, THREAD_LINK_POLL_PERIOD);

  /* Set the sleepy end device mode */
  OT_LinkMode.mRxOnWhenIdle = 0;
  OT_LinkMode.mSecureDataRequests = 1U;
  OT_LinkMode.mDeviceType = 0;
  OT_LinkMode.mNetworkData = 1U;

  error = otThreadSetLinkMode(NULL,OT_LinkMode);
  if (error != OT_ERROR_NONE)
    APP_THREAD_Error(ERR_THREAD_LINK_MODE,error);

  /* After reaching the child or router state, the system
   *   a) sets the 'sleepy end device' mode
   *   b) perform a Thread stop
   *   c) perform a Thread start.
   *
   *  NOTE : According to the Thread specification, it is necessary to set the
   *         mode before starting Thread.
   *
   * A Child that has attached to its Parent indicating it is an FTD MUST NOT use Child UpdateRequest
   * to modify its mode to MTD.
   * As a result, you need to first detach from the network before switching from FTD to MTD at runtime,
   * then reattach.
   *
   */
  if (sleepyEndDeviceFlag == FALSE)
  {
    error = otThreadSetEnabled(NULL, false);
    if (error != OT_ERROR_NONE)
      APP_THREAD_Error(ERR_THREAD_LINK_MODE,error);
    error = otThreadSetEnabled(NULL, true);
    if (error != OT_ERROR_NONE)
      APP_THREAD_Error(ERR_THREAD_LINK_MODE,error);
    sleepyEndDeviceFlag = TRUE;
  }

  APP_DBG("Start CoAP timer for data sending");
  /* Start the timer */
//#if OT_AUTOSTART_MODE && OT_COAP_START
  HW_TS_Start(sedCoapTimerID, (uint32_t)COAP_SEND_TIMEOUT);
//#endif
}

static void APP_THREAD_CoapTimingElapsed( void )
{
  UTIL_SEQ_SetTask(TASK_COAP_SEND_MSG,CFG_SCH_PRIO_1);
}

static void APP_THREAD_SetThreadMode( void )
{
  UTIL_SEQ_SetTask(TASK_SET_THREAD_MODE,CFG_SCH_PRIO_1);
}

/**
 *
  * @brief  Warn the user that an error has occurred.In this case,
  *         the LEDs on the Board will start blinking.
  *
  * @param  Mess  : Message associated to the error.
 * @param  ErrCode: Error code associated to the module (OpenThread or other module if any)
  * @retval None
  */
static void APP_THREAD_TraceError(const char * pMess, uint32_t ErrCode)
{
  APP_DBG("**** Fatal error = %s (Err = %d)",pMess,ErrCode);
  while(1U == 1U)
  {
    BSP_LED_Toggle(LED1);
    HAL_Delay(500U);
    BSP_LED_Toggle(LED2);
    HAL_Delay(500U);
    BSP_LED_Toggle(LED3);
    HAL_Delay(500U);
 }
}

/**
 * @brief Check if the Coprocessor Wireless Firmware loaded supports Thread
 *        and display associated informations
 * @param  None
 * @retval None
 */
static void APP_THREAD_CheckWirelessFirmwareInfo(void)
{
  WirelessFwInfo_t wireless_info_instance;
  WirelessFwInfo_t* p_wireless_info = &wireless_info_instance;

  if (SHCI_GetWirelessFwInfo(p_wireless_info) != SHCI_Success)
  {
    APP_THREAD_Error((uint32_t)ERR_THREAD_CHECK_WIRELESS, (uint32_t)ERR_INTERFACE_FATAL);
  }
  else
  {
    APP_DBG("**********************************************************");
    APP_DBG("WIRELESS COPROCESSOR FW:");
    /* Print version */
    APP_DBG("VERSION ID = %d.%d.%d", p_wireless_info->VersionMajor, p_wireless_info->VersionMinor, p_wireless_info->VersionSub);

    switch(p_wireless_info->StackType)
    {
    case INFO_STACK_TYPE_THREAD_FTD :
      APP_DBG("FW Type : Thread FTD");
      break;
    case INFO_STACK_TYPE_THREAD_MTD :
      APP_DBG("FW Type : Thread MTD");
      break;
    case INFO_STACK_TYPE_BLE_THREAD_FTD_DYAMIC :
      APP_DBG("FW Type : Dynamic Concurrent Mode BLE/Thread");
      break;
    default :
      /* No Thread device supported ! */
      APP_THREAD_Error((uint32_t)ERR_THREAD_CHECK_WIRELESS, (uint32_t)ERR_INTERFACE_FATAL);
      break;
    }
    APP_DBG("**********************************************************");
  }
}

